# Дан список чисел. Определите, сколько в нем встречается различных чисел.

# Input: [1, 1, 2, 0, -1, 3, 4, 4]

# Output: 6

StartList = [1, 1, 2, 0, -1, 3, 4, 4]
print (len(set(StartList)))

# множество set()
# нет индексов
# уникальные элементы
# изменяемые

# List [] - список - изменяемый - индексируемый

# set_1=set()

# for i in StartList:
#     set_1.add(i)

# print(len(set_1))

List = {1, 6, -8, 'pro', -5, -5, 1}
print (set (List))